[
  {
    "link": "https://nimbusplatform.io/",
    "task": "Nimbus Platform, a DeFi solutions provider, strives to build a user-friendly platform that combines multiple financial instruments. Our team developed smart contracts, backend and frontend solutions, and performed full product testing. We delivered over a dozen products, including affiliate programs, a swap engine, staking scenarios, governance, lending/borrowing ecosystem, cross-chain token wrapping, P2P exchange, financial derivative NFT token, and cash flow analytics. As a result, Nimbus Platform received a comprehensive DeFi platform that outperforms many big competitors in functionality and continues to evolve successfully.",
    "action": "Nimbus Platform, a DeFi solutions provider, strives to build a user-friendly platform that combines multiple financial instruments. Our team developed smart contracts, backend and frontend solutions, and performed full product testing. We delivered over a dozen products, including affiliate programs, a swap engine, staking scenarios, governance, lending/borrowing ecosystem, cross-chain token wrapping, P2P exchange, financial derivative NFT token, and cash flow analytics. As a result, Nimbus Platform received a comprehensive DeFi platform that outperforms many big competitors in functionality and continues to evolve successfully.",
    "result": "As a result of our efforts, Nimbus Platform successfully operates their comprehensive DeFi platform with a wider range of functionality than many big competitors. The platform continues to evolve based on the foundation laid by our efforts. By addressing both the technical and business challenges, we helped Nimbus to achieve their goal to make an intuitive and versatile platform that caters to various users in the crypto market.",
    "summary": "Nimbus Platform, a DeFi solutions provider, strives to build a user-friendly platform that combines multiple financial instruments. Our team developed smart contracts, backend and frontend solutions, and performed full product testing. We delivered over a dozen products, including affiliate programs, a swap engine, staking scenarios, governance, lending/borrowing ecosystem, cross-chain token wrapping, P2P exchange, financial derivative NFT token, and cash flow analytics. As a result, Nimbus Platform received a comprehensive DeFi platform that outperforms many big competitors in functionality and continues to evolve successfully.",
    "situation": "Nimbus Platform, a DeFi solutions provider, strives to build a user-friendly platform that combines multiple financial instruments. Our team developed smart contracts, backend and frontend solutions, and performed full product testing. We delivered over a dozen products, including affiliate programs, a swap engine, staking scenarios, governance, lending/borrowing ecosystem, cross-chain token wrapping, P2P exchange, financial derivative NFT token, and cash flow analytics. As a result, Nimbus Platform received a comprehensive DeFi platform that outperforms many big competitors in functionality and continues to evolve successfully.",
    "actionList": [
      "three types of affiliate programs,",
      "a swap engine with a supporting project affiliate program,",
      "staking family (up to 10 different staking scenarios),",
      "governance,",
      "lending/borrowing ecosystem,",
      "cross-chain token wrapping,",
      "projects P2P exchange,",
      "financial derivative NFT token,",
      "admin dashboard, and",
      "full project’s cash flow analytics.",
      "Upon request, we also prepared the documentation package."
    ],
    "technology": [
      {
        "name": "NFT",
        "marker": "#EB3795"
      },
      {
        "name": "Swap",
        "marker": "#EB3795"
      },
      {
        "name": "Staking",
        "marker": "#EB3795"
      },
      {
        "name": "P2P",
        "marker": "#EB3795"
      },
      {
        "name": "DeX",
        "marker": "#EB3795"
      },
      {
        "name": "Ethereum",
        "marker": "#EB3795"
      },
      {
        "name": "Binance",
        "marker": "#EB3795"
      }
    ],
    "paltfornName": "Nimbus Platform",
    "technologyStack": {
      "backend": [
        "Node.js,",
        "web3.js,",
        "Sequelize,",
        "Apollo-Client,",
        "GraphQL,",
        "LogDNA,"
      ],
      "network": ["Ethereum", "Binance"],
      "database": ["PostgreSQL"],
      "frontend": ["React.js", "web3.js"],
      "blockchain": ["Solidity", "Hardhat", "Node.js", "ethers.js"],
      "infrastructure": ["GitHub"]
    }
  },

  {
    "link": "",
    "task": "Initially, we were presented only with a whitepaper sketch and a game genre idea. Our task was to develop a complete solution for CryptoSerpent and help organize project funding through an NFT sale.",
    "action": "After the discovery phase, we organized an NFT sale of “eggs” from which playable snakes would grow in the game after its release. This artifact token sale was a success and funded further development. During the development process, our team provided a full package of services for CryptoSerpent, including smart contract development on the Binance Smart Chain Network, backend, frontend, game logic, and full test coverage. Technically, it was interesting to utilize EIP20, EIP1155, and EIP721 tokens in one project. A high point in development was the unique mix of backend and smart contracts with highly optimized gas costs for the Snake game engine. In addition to the core game, we created",
    "result": "As a result of our efforts, CryptoSerpent had a successful NFT sale and then successfully launched as a play-to-earn game. Several updates were made after the initial release, introducing a P2P marketplace and the ability to exchange NFTs. For us, the project provided a complex game development experience and an opportunity to apply our blockchain expertise in GameFi. CryptoSerpent continues to engage its target audience, offering an enjoyable gaming experience combined with real cryptocurrency earnings.",

    "summary": "CryptoSerpent is a nostalgic play-to-earn game that combines the classic Snake gameplay with blockchain technologies, targeting gamers aged 14-30. Our team developed a complete solution for the project, including organizing a successful NFT sale of “eggs” to fund development. We provided a full package of services such as smart contract development, backend, frontend, game logic, and testing. The project resulted in a successful play-to-earn game launch, with several updates that introduced a P2P marketplace and the ability to exchange NFTs. CryptoSerpent offers an engaging gaming experience while allowing players to earn real cryptocurrency.",

    "situation": "The CryptoSerpent team aimed to revive fond memories for gamers with a play-to-earn twist. The fundamental Snake gameplay has been consistent since its inception in the 1970s arcades and its resurgence on 1990s Nokia mobile phones (depending on the generation of gamers you ask). The player must prevent the snake from crashing into obstacles or its own body, a task that grows increasingly difficult as the snake grows with each eaten piece of food. By incorporating blockchain technologies into it, CryptoSerpent not only creates nostalgia but also allows to earn real cryptocurrency. The target audience ranges from 14-30 years old.",
    "actionList": [
      "a P2P marketplace for selling/buying project artifacts among players,",
      "admin-side analytics, and",
      "staking family (up to 10 different staking scenarios),",
      "Telegram bots"
    ],
    "technology": [
      {
        "name": "NFT",
        "marker": "#EB3795"
      },
      {
        "name": "P2P",
        "marker": "#EB3795"
      },
      {
        "name": "Binance",
        "marker": "#EB3795"
      },
      {
        "name": "P2E",
        "marker": "#EB3795"
      },
      {
        "name": "DeFI",
        "marker": "#EB3795"
      },
      {
        "name": "GameFi",
        "marker": "#EB3795"
      }
    ],
    "paltfornName": "CryptoSerpent",
    "technologyStack": {
      "backend": [
        "Node.js,",
        "web3.js,",
        "Sequelize,",
        "Apollo-Client,",
        "GraphQL,"
      ],
      "network": ["Binance Smart Chain"],
      "database": ["PostgreSQL"],
      "frontend": ["React.js", "web3.js"],
      "blockchain": ["Solidity", "Hardhat", "Node.js", "ethers.js"],
      "infrastructure": ["GitHub", "heroku"]
    }
  },

  {
    "link": "https://www.liquidaccess.com/",
    "task": "Liquid Access had the idea and UI design concept, and they sought our help to refine it and bring the product to market. Our task was to develop a complete solution, including the development of smart contracts, backend, frontend, and full product testing.",
    "action": "Our team began with a discovery phase, during which we collaborated with the client to understand their requirements and propose a solution. After the client approved the discovery, we provided a full package of services that included the development of smart contracts for the Polygon Network (selected for its low gas fees), backend/frontend code, and QA effort. We developed and released the following products for the project:",
    "result": "As a result of our efforts, Liquid Access successfully launched a novel NFT subscription service and auction platform catering to their target audience. Exactly as conceived, the platform allows users to efficiently manage, transfer, or sell their subscriptions using NFTs. Their 1st customer brand is Aloha browser. As for our team, this interesting project, which is different from the classic DeX stuff, provided us with valuable experience in creating lightweight and innovative solutions.",

    "summary": "Liquid Access is a blockchain-based subscription management tool that generates NFT tokens for users with memberships or subscriptions to partner services. Our team developed a complete solution, including smart contracts, backend, frontend, and full QA. We used the Polygon Network for low gas fees and developed EIP721 project token, API architecture, subscription service, and auction bidding platform. As a result, Liquid Access has successfully launched and it enhances the crypto world with an efficient way to manage, transfer, or sell subscriptions using NFTs.",

    "situation": "Liquid Access wanted to create a blockchain subscription management tool. They envisioned a platform that generates NFT tokens for users with memberships or subscriptions to partner services. For businesses, tokenization of loyalty programs prevents double spending of perks and benefits, as well as multiple ownership. NFTs also offer unprecedented marketing possibilities. For consumers, NFTs provide a sense of true ownership, easy transfer to others, an auction platform to buy and sell subscriptions, and potential profit if the NFT price rises. The target audience consists of people who use subscription-based services and are familiar with the crypto world.",

    "actionList": [
      "a unique EIP721 project token,",
      "API architecture,",
      "subscription service, and",
      "auction bidding platform."
    ],
    "actionSub": ["We then handed over the complete code to the customer."],
    "technology": [
      {
        "name": "NFT",
        "marker": "#eb3795"
      },
      {
        "name": "Polygon",
        "marker": "#8642ca"
      },
      {
        "name": "Auction",
        "marker": "#2cc0a6"
      }
    ],
    "paltfornName": "CryptoSerpent",
    "technologyStack": {
      "backend": ["Node.js,", "web3.js,", "Sequelize,", "web3.js"],
      "network": ["Polygon"],
      "database": ["PostgreSQL"],
      "frontend": ["React.js", "web3.js"],
      "blockchain": ["Solidity", "Hardhat", "Node.js", "ethers.js"],
      "infrastructure": ["GitHub", "heroku"]
    }
  }
]
